In [29]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt

In [30]:
data = pd.read_csv("C:/Users/Matt/Desktop/hackathons/APHRC/data/synthetic_hdss_v2.csv")

In [31]:
data.head()

,recnr,firstname,lastname,petname,dob,sex,nationalid,hdssid,hdsshhid
0,1,Zaina,Hanifa,Ula,22-09-1930 00:00,2,NaN,I20001,HH100001
1,2,Godfrey,Maganda,Mukama,15-07-1934 00:00,1,NaN,I20002,HH100002
2,3,Kasim,Ngobi,Galabuzi,03-03-1983 00:00,1,NaN,I20003,HH100003
3,4,Esther,NaN,Inara,30-07-1968 00:00,2,NaN,I20004,HH100004
4,5,Sumaya,Swabula,NaN,13-12-1930 00:00,2,NaN,I20005,HH100005

In [32]:
data.shape

(4115, 9)

In [33]:
data.isnull().sum()

recnr            0
firstname        0
lastname        84
petname       1221
dob              0
sex              0
nationalid    4115
hdssid           0
hdsshhid         0
dtype: int64

In [34]:
df = pd.DataFrame(data)

In [35]:
df = df.drop(['nationalid'], axis=1)
df.head()

   recnr firstname lastname   petname               dob  sex  hdssid  hdsshhid
0      1     Zaina   Hanifa       Ula  22-09-1930 00:00    2  I20001  HH100001
1      2   Godfrey  Maganda    Mukama  15-07-1934 00:00    1  I20002  HH100002
2      3     Kasim    Ngobi  Galabuzi  03-03-1983 00:00    1  I20003  HH100003
3      4    Esther      NaN     Inara  30-07-1968 00:00    2  I20004  HH100004
4      5    Sumaya  Swabula       NaN  13-12-1930 00:00    2  I20005  HH100005

In [37]:
df.isnull().sum()

recnr           0
firstname       0
lastname       84
petname      1221
dob             0
sex             0
hdssid          0
hdsshhid        0
dtype: int64